; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob79) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate4)
	(at pallet2 depot2)
	(clear crate6)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 distributor2)
	(clear crate7)
	(at pallet7 depot0)
	(clear crate2)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 depot1)
	(clear crate5)
	(at pallet10 depot1)
	(clear pallet10)
	(at truck0 depot2)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at crate0 depot2)
	(on crate0 pallet2)
	(at crate1 depot1)
	(on crate1 pallet9)
	(at crate2 depot0)
	(on crate2 pallet7)
	(at crate3 distributor2)
	(on crate3 pallet6)
	(at crate4 depot1)
	(on crate4 pallet1)
	(at crate5 depot1)
	(on crate5 crate1)
	(at crate6 depot2)
	(on crate6 crate0)
	(at crate7 distributor2)
	(on crate7 crate3)
	(at crate8 distributor2)
	(on crate8 pallet5)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet7)
		(on crate2 pallet5)
		(on crate3 pallet10)
		(on crate4 crate7)
		(on crate5 pallet4)
		(on crate6 crate0)
		(on crate7 pallet6)
		(on crate8 crate6)
	)
))

; plan
1. (lift hoist5 crate7 crate3 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 crate3)
   added: (lifting hoist5 crate7) (clear crate3)
   goals met: 2 of 9
2. (lift hoist8 crate2 pallet7 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist8) (on crate2 pallet7)
   added: (lifting hoist8 crate2) (clear pallet7)
   goals met: 2 of 9
3. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 2 of 9
4. (load hoist8 crate2 truck0 depot0)
   deleted: (lifting hoist8 crate2)
   added: (in crate2 truck0) (available hoist8)
   goals met: 2 of 9
5. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 2 of 9
6. (lift hoist6 crate5 crate1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist6) (on crate5 crate1)
   added: (lifting hoist6 crate5) (clear crate1)
   goals met: 2 of 9
7. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 2 of 9
8. (load hoist6 crate5 truck1 depot1)
   deleted: (lifting hoist6 crate5)
   added: (in crate5 truck1) (available hoist6)
   goals met: 2 of 9
9. (lift hoist6 crate1 pallet9 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist6) (on crate1 pallet9)
   added: (lifting hoist6 crate1) (clear pallet9)
   goals met: 2 of 9
10. (load hoist6 crate1 truck1 depot1)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck1) (available hoist6)
   goals met: 2 of 9
11. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 2 of 9
12. (unload hoist8 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist8)
   added: (lifting hoist8 crate1)
   goals met: 2 of 9
13. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 2 of 9
14. (unload hoist4 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist4)
   added: (lifting hoist4 crate5)
   goals met: 2 of 9
15. (drop hoist4 crate5 pallet4 distributor1)
   deleted: (lifting hoist4 crate5) (clear pallet4)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 pallet4)
   goals met: 3 of 9
16. (drop hoist8 crate1 pallet7 depot0)
   deleted: (lifting hoist8 crate1) (clear pallet7)
   added: (available hoist8) (at crate1 depot0) (clear crate1) (on crate1 pallet7)
   goals met: 4 of 9
17. (lift hoist6 crate4 pallet1 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist6) (on crate4 pallet1)
   added: (lifting hoist6 crate4) (clear pallet1)
   goals met: 4 of 9
18. (load hoist5 crate7 truck0 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck0) (available hoist5)
   goals met: 4 of 9
19. (lift hoist7 crate3 pallet6 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist7) (on crate3 pallet6)
   added: (lifting hoist7 crate3) (clear pallet6)
   goals met: 4 of 9
20. (load hoist7 crate3 truck0 distributor2)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck0) (available hoist7)
   goals met: 4 of 9
21. (unload hoist7 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist7)
   added: (lifting hoist7 crate2)
   goals met: 4 of 9
22. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 4 of 9
23. (lift hoist5 crate8 pallet5 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet5)
   added: (lifting hoist5 crate8) (clear pallet5)
   goals met: 4 of 9
24. (drop hoist7 crate2 pallet5 distributor2)
   deleted: (lifting hoist7 crate2) (clear pallet5)
   added: (available hoist7) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 5 of 9
25. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 5 of 9
26. (unload hoist7 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist7)
   added: (lifting hoist7 crate7)
   goals met: 5 of 9
27. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   goals met: 5 of 9
28. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 5 of 9
29. (unload hoist1 crate3 truck0 depot1)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   goals met: 5 of 9
30. (load hoist6 crate4 truck0 depot1)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck0) (available hoist6)
   goals met: 5 of 9
31. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 5 of 9
32. (unload hoist9 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist9)
   added: (lifting hoist9 crate8)
   goals met: 5 of 9
33. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 5 of 9
34. (unload hoist5 crate4 truck0 distributor2)
   deleted: (in crate4 truck0) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 5 of 9
35. (drop hoist1 crate3 pallet10 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet10)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet10)
   goals met: 6 of 9
36. (drop hoist7 crate7 pallet6 distributor2)
   deleted: (lifting hoist7 crate7) (clear pallet6)
   added: (available hoist7) (at crate7 distributor2) (clear crate7) (on crate7 pallet6)
   goals met: 7 of 9
37. (drop hoist9 crate8 crate6 depot2)
   deleted: (lifting hoist9 crate8) (clear crate6)
   added: (available hoist9) (at crate8 depot2) (clear crate8) (on crate8 crate6)
   goals met: 8 of 9
38. (drop hoist5 crate4 crate7 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate7)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate7)
   goals met: 9 of 9
